<template>
  <div>
    備註： (1) 可選擇私人一對一、親子班或小組形式上課，可於 (戶外或上門教授) 或
    (學員提供場地) 授課。 (2) 十三歲或以上成人，每堂1.5小時計算，
    十二歲或以下兒童，每堂1小時，四堂為一期 。 (3)
    每期課程逾期四十日後將當放棄上堂論，所有課程將會被取消。 (4)
    為了配合繁忙的生活節奏，我們每星期七天均可以提供課堂，讓您選擇最合適方便的地點及時段上課。
    (5)
    本會可推薦學員報考國家認可防身自衛術證書，政府認可之散手章別計劃全港考核試及各專業證書課程。
    (6)
    私教學員每月可不限次數、時段及地點上課。目的是希望新學員有更多的時間和機會練習。
    (7) 各私教學員經考核合格，可申請認可實用自衛散手級位或段位証書。 (8)
    歡迎幼稚園、中小學、專上院校、私人機構合辦長期或短期的各項武術訓練課程。
  </div>
</template>

<script lang="ts">
import { defineComponent } from "vue";

export default defineComponent({
  name: "ClassInfoNotes",
});
</script>

<style lang="scss" scoped></style>
