<template>
  <TabView :activeIndex="activeIndex">
    <TabPanel
      v-for="course in courses"
      :key="course.name"
      :header="course.name"
    >
      <Markdown :source="course.content + footer" />
    </TabPanel>

    <TabPanel header="私人武术课程">
      <private-wu-shu />
    </TabPanel>
    <TabPanel header="私人亲子功夫班">
      <private-family-kung-fu />
    </TabPanel>
  </TabView>
</template>

<script>
import PrivateFamilyKungFu from "./Details/PrivateFamilyKungFu.vue";
import PrivateWuShu from "./Details/PrivateWuShu.vue";

import Markdown from "@/components/others/Markdown.vue";
import { defineComponent } from "@vue/runtime-core";
import { useMeta } from "vue-meta";

export default defineComponent({
  components: {
    PrivateWuShu,
    PrivateFamilyKungFu,
    Markdown,
  },
  name: "CourseContent",
  setup() {
    useMeta({
      title: "課程內容",
    });
  },
  data() {
    return {
      activeIndex: 0,
      footer: `\n\n---\n如希望自行组班或报名私人班，欢迎浏览*私人及组班课程*\n如有任何疑问，欢迎进行咨询`,
      courses: [
        {
          name: "太极",
          content: `## 引言\n香港人做事争分夺秒，工作压力大，运动量少，以致经常出现精神紧张、肌肉紧绷、关节劳损等都市病。因此，运动对于任何人都可谓不可而缺少。那如何才能选择适合自己的运动呢？气势任何运动对健康都有益处，不过想要性运动中改善自己的健康的话，便需要持之以恒。然而有些运动，比如跑步、球类、技击等，长时间的练习可能领你的肌肉劳损，关节受伤，而且年紀越大便越會覺得體能上難以應付。\n而太極拳與一般運動不同，它不受年齡大小、體能強弱的影響。因為太極拳以柔為主，以緩慢如流水般的動作、绵长的呼吸，意識的專注配合，持之以恒地練習，定能改善血液循環，促進新陳代謝，增強心肺功能、强化肌肉、关节和骨质、清除壓力，使身體各部份得以放鬆，達至身心內外平衡，增強抵抗力，身體自然得到健康。\n## 详情\n教学形式：上门教授、私人、小组教学\n教练：本会由全职专业注册教练任教（香港太極總會持牌太極導師\n对象：凡對太極拳有興趣者，均可參加\n时段：私人组班时间为双方协定，可灵活安排合适时段\n地点：双方协定，可于室外、各區體育館或學員提供室內場地練習\n## 常规班\n**紅磡 香港體育館側 4:00－5:30pm**\n**坑口文曲皇公園 4:00－5:30pm**\n**灣仔 港灣道公園 4:00－5:30pm**\n**沙田 公園 4:00－5:30pm**`,
        },
        {
          name: "泰拳",
          content: `# 泰拳\n## 引言\n本會屬於 香港泰拳理事會 核下屬會， 教授泰拳基本技巧包括步法， 拳招， 肘招， 腿招， 膝招及散打自衛術技巧，本课程旨在加強學員的防衛意識，并透過擊靶訓練，培養学员的反應及敏捷度。\n在經驗豐富的專業泰拳及散手教練的指導下，讓你真正認識泰拳運動的精神與打法，學習基本技巧，透過練習與訓練，可鍛練體能、增加肌肉，更可排汗塑身。享受運動的樂趣！\n## 详情\n教学形式：上门教授、私人、小组教学\n教练：本会由全职专业注册教练任教（持有认可泰拳级Kick Boxing 專業教練證書）\n对象：**7**歲或以上對泰拳有興趣人士\n 时段：私人组班时间为双方协定，可灵活安排合适时段\n地点：双方协定，可于室外、各區體育館、私人会所或學員提供室內場地練習\n## 常规班\n柴灣區上課（近地鐵站）星期二 8:00 - 10:00pm`,
        },
        {
          name: `女子自卫术`,
          content: `# 女子自卫术\n## 引言\n女子自衛術是一項專為女子而設的訓練課程，課程內容會以女子防衛術作主要的訓練，這是一項運用踢、打、摔、拿等武術技擊的方法，如當面臨受制於歹徒時，並具備簡單、實用、易記、易學的特點。它是一種以制服對方、保護自己為目的的專門技術。此課程將會由淺入深地介紹自衛術的基本概念及原理，適合現代女性的自我防衛技術。\n此課程為個人/小組的訓練課程，並由持有專業資格教練親自指導，教練與學員課程前的訪談和進行瞭解，而設計一份訓練訓劃，為不同程度的學員度身訂做一套教學模式，確保每位學員在每次訓練中都能吸收其訓練效果。\n在專業導師的指導下，確保您在安全情況下盡情鬆弛減壓及體驗女子自衛術的真正樂趣，在短期內有效改善自衛搏擊技巧。增強心肺功能、有效燃燒體脂肪、加強身體協調性、反應力、敏銳度與速度。為了配合您繁忙的生活節奏，我們每星期七天均可以提供全日不同時段課堂，讓您選擇最合適方便的上課地點及時間。\n## 内容简介（以下列表统一格式）\n女子自衛術課程特點： 女子自衛術技術特點、使用原則、制敵部位、基本功法、技術動作、招法訓練、針對不同侵害方式	的自衛招法、 特殊情況下的自衛招法的運用。\n### 防身四大觀念：\n1. 隨時注意安全\n1. 迴避危險情境\n1. 迅速逃離危機\n 1. 冷靜面對歹徒\n### 自衛術制敵的有效部位\n1. 眼睛\n1. 咽喉\n1. 頸側\n1. 腋下\n1. 襠部\n### 自衛術基本訓練內容\n1. 拳法\n1. 掌法\n1. 肘法\n1. 腿法\n1. 膝法\n1. 擒拿\n1. 摔法\n1. 基本護身倒法\n同時配以不同程度的手把、腳靶，配合拳、腿、肘、膝擊靶等訓練。\n### 自衛術基本課程\n1. 人體薄弱要害部位\n1. 自衛術基本技術\n1. 實用攻擊技術\n1. 自衛實戰功夫應用\n1. 安全防范常識\n### 化解摟抱技巧之練習及運用\n1. 腕部被抓解脫技術\n1. 前後抱腰解脫技術\n1. 前後鎖喉解脫技術\n1. 雙手被抓解脫技術\n1. 胸襟被抓解脫技術\n1. 前後抓肩解脫技術\n1. 前後抓頭解脫技術\n1. 抓腕解脫反擒法\n1. 抓胸解脫反擒法\n1. 前勒解脫反擒法\n1. 前抓解脫反擒法\n## 详情\n教学形式：上门教授、私人、小组教学\n教练：本会由全职专业注册教练任教（持有香港认可注册武术教练及防身自卫术三段證書专业资格）\n对象：**7**歲或以上對防身自衛術有興趣人士\n时段：私人组班时间为双方协定，可灵活安排合适时段\n地点：双方协定，可于室外、各區體育館、私人会所或學員提供室內場地練習\n## 常规班\n**灣仔 港灣道體育館**  星期三  5:00 - 6:30 pm`,
        },
        {
          name: "儿童武术",
          content: `# 儿童武术\n## 引言\n兒童一向有服從性低，欠缺積極性的特点，練習中國武術除了可以锻炼体魄之外，亦可訓練小朋友手腳恊調，鼓励自我挑戰及学习紀律服從，是小朋友健康成長好方式。由於實用自衛散手按級別分為不同色帶，及定期晉升考試制度，由白帶學起，可按學習進度考升級試一至十級，最終有機會升至黑帶。有了逐級晉升的目標，便會不斷自我挑戰，學習態度亦會更加專心，成功考取更高級別，更可提升成功感，滿足感及自信，從小培養不斷進步的學習態度。\n在科技發達的今天，學校和家庭給孩子的生活教育型態，物質重於精神，導致子們喪失了很多他們本身具有的功能──物質條件的富裕、生活規範的不夠嚴謹，導致孩子的柔弱和過於被動，抗壓能力普遍降低，這些都是父母應該關切的問題。我們是不是在忙於事業名利外，給自己和孩子的健康多做一點投資？\n## 内容简介\n### 習武對孩子的好處 ： （同女子自卫术列表格式）\n1. 讓孩子更了解自己的身體和力量；調整良好儀態，調理強健體質。\n2. 能讓孩子隨時具備了保護自己的觀念與能力，增加了自信和勇氣。\n3. 能更輕鬆的去控制自己的外在肢體動作和內在情緒反應。\n4. 學習實用散手自衛術增強保護自我的能力。\n### 我們的專業教練团队：\n1. 具備專業證書\n2. 具備良好教學技巧\n3. 能協助學員達到目的\n4. 非常專業的武術相關知識和技能\n5. 能做到示範動作，令學員依從學習。\n6. 檢討學習進度，針對弱項，調整教學計劃，協助學員發揮潛能。\n## 详情\n教学形式：上门教授、私人、小组教学\n教练：本会由全职专业注册教练任教\n对象：**7**歲或以上對防身自衛術有興趣人士\n 时段：私人组班时间为双方协定，可灵活安排合适时段\n地点：双方协定，可于室外、各區體育館、私人会所或學員提供室內場地練習\n## 常规班\n **牛頭角振華道體育館 星期日 12:00-1:00pm**\n**九龍 土瓜灣體育館 星期三 7:30 - 8:30pm**\n **北角渣華道體育館 星期五 5:00－6:00pm**\n**鑽石山蒲崗村道體育館 逢星期六 6:00-7:00pm**\n**旺角花園街體育館 星期一 5:00－6:00pm**`,
        },
      ],
    };
  },
  created() {
    this.setTab();
  },
  updated() {
    this.setTab();
  },

  methods: {
    setTab() {
      const type = this.$route.params.type;
      console.log(type);
      if (type) {
        this.activeIndex = parseInt(type);
        this.$router.push("/course/content");
      }
    },
  },
});
</script>

<style lang="scss" scoped>
.sizes {
  .p-inputtext {
    display: block;
    margin-bottom: 0.5rem;

    &:last-child {
      margin-bottom: 0;
    }
  }
}
.p-field * {
  display: block;
}
</style>
