<!--
 * @Author: YYYeung
 * @Github: https://github.com/sheepyy039
 * @Date: 2022-01-12 15:48:44
 * @LastEditors: YYYeung
 * @LastEditTime: 2022-01-17 17:02:08
 * @FilePath: /hksanda-website/src/views/Course/CourseSessionView.vue
 * @Description: 
-->
<template>
  <div>
    <h1>私人及組班課程</h1>
    <markdown :source="source" />
  </div>
</template>

<script>
import Markdown from "@/components/others/Markdown.vue";
import { useMeta } from "vue-meta";

export default {
  name: "CourseSession",
  components: {
    Markdown,
  },
  setup() {
    const source = `## 引言\n私人課程為個人或小組密集式訓練，並由專業教練親自指導，教練與學員課程前的訪談和進行瞭解，而設計一份訓練計劃，為不同程度的學員度身訂做一套教學內容，每位學員上課內容可能會略有不同，以確保每位學員在每次訓練中都能達至明顯的訓練效果。學員藉由不同的教學方式。\n武術屬於全身帶氧運動， 是一種能夠防身自衛、瘦身健美、增加自信的體育運動，因此現已成為一種都市非常流行的運動，私人課程教練具備各項教練及裁判證書的專業資格，能為學員提供度身訂造合適的訓練計劃。專業教練以化繁為簡， 通過武術特有的動作，循序漸進地增加運動量以達至強身健體及修身減脂的功能， 而學員們更可自行組班作定時定點的訓練，使課堂更有彈性。\n *为适应港人生活节奏，本会开设除常规班以外的私人及组班课程。可从学习内容中任意挑选感兴趣的项目进行，上课模式包括一对一私人班，亲子班，多人或组班。场地、时间均可自选。*\n## 我们的教练资历\n1. 具備專業證書\n1. 具備良好教學技巧\n1. 能協助學員達到目的\n1. 非常專業的武術相關知識和技能\n1. 能做到示範動作，令學員依從學習。\n1. 檢討學習進度，針對弱項，調整教學計劃，協助學員發揮潛能。\n## 備註\n1. 可選擇私人一對一、親子班或小組形式上課，可於 **（戶外或上門教授）或（學員提供場地）** 授課。\n1. 十三歲或以上成人，每堂**1.5**小時計算， 十二歲或以下兒童，每堂**1**小時，四堂為一期。\n1. 每期課程逾期四十日後將當放棄上堂論，所有課程將會被取消。\n1. 為了配合繁忙的生活節奏，我們每星期七天均可以提供課堂，讓您選擇最合適方便的地點及時段上課。\n1. 本會可推薦學員報考國家認可防身自衛術證書，政府認可之散手章別計劃全港考核試及各專業證書課程。\n1. 私教學員每月可不限次數、時段及地點上課。目的是希望新學員有更多的時間和機會練習。\n1. 各私教學員經考核合格，可申請認可實用自衛散手級位或段位証書。\n1. 歡迎幼稚園、中小學、專上院校、私人機構合辦長期或短期的各項武術訓練課程。\n**熱線：97322082 WhatsApp 傅教練 彈性上課時間及地點。**\n[立即报名](/contact)！`;
    useMeta({
      title: "私人及組班課程",
      // htmlAttrs: {
      //   lang: "zh-HK",
      //   amp: true,
      // },
    });
    return { source };
  },
};
</script>

<style lang="scss" scoped></style>
