<template>
  <markdown :source="source" />
</template>

<script>
import Markdown from "@/components/others/Markdown.vue";

export default {
  components: { Markdown },
  name: "ChildrenWuShu",
  data() {
    return {
      source: `# 儿童武术\n## 引言\n兒童一向有服從性低，欠缺積極性的特点，練習中國武術除了可以锻炼体魄之外，亦可訓練小朋友手腳恊調，鼓励自我挑戰及学习紀律服從，是小朋友健康成長好方式。由於實用自衛散手按級別分為不同色帶，及定期晉升考試制度，由白帶學起，可按學習進度考升級試一至十級，最終有機會升至黑帶。有了逐級晉升的目標，便會不斷自我挑戰，學習態度亦會更加專心，成功考取更高級別，更可提升成功感，滿足感及自信，從小培養不斷進步的學習態度。\n在科技發達的今天，學校和家庭給孩子的生活教育型態，物質重於精神，導致子們喪失了很多他們本身具有的功能──物質條件的富裕、生活規範的不夠嚴謹，導致孩子的柔弱和過於被動，抗壓能力普遍降低，這些都是父母應該關切的問題。我們是不是在忙於事業名利外，給自己和孩子的健康多做一點投資？\n## 内容简介\n### 習武對孩子的好處 ： （同女子自卫术列表格式）\n1. 讓孩子更了解自己的身體和力量；調整良好儀態，調理強健體質。\n2. 能讓孩子隨時具備了保護自己的觀念與能力，增加了自信和勇氣。\n3. 能更輕鬆的去控制自己的外在肢體動作和內在情緒反應。\n4. 學習實用散手自衛術增強保護自我的能力。\n### 我們的專業教練团队：\n1. 具備專業證書\n2. 具備良好教學技巧\n3. 能協助學員達到目的\n4. 非常專業的武術相關知識和技能\n5. 能做到示範動作，令學員依從學習。\n6. 檢討學習進度，針對弱項，調整教學計劃，協助學員發揮潛能。\n## 详情\n教学形式：上门教授、私人、小组教学\n教练：本会由全职专业注册教练任教\n对象：**7**歲或以上對防身自衛術有興趣人士\n 时段：私人组班时间为双方协定，可灵活安排合适时段\n地点：双方协定，可于室外、各區體育館、私人会所或學員提供室內場地練習\n## 常规班\n **牛頭角振華道體育館 星期日 12:00-1:00pm**\n**九龍 土瓜灣體育館 星期三 7:30 - 8:30pm**\n **北角渣華道體育館 星期五 5:00－6:00pm**\n**鑽石山蒲崗村道體育館 逢星期六 6:00-7:00pm**\n**旺角花園街體育館 星期一 5:00－6:00pm**`,
    };
  },
};
</script>

<style lang="scss" scoped></style>
