<template>
  <div>
    <h1>兒童武術課程</h1>
    <div>
      <p>
        兒童服從性低，欠缺積極性，練習中國武術除了可以強身健體之外，亦可訓練小朋友手腳恊調，鍛練自我挑戰及紀律服從，是小朋友健康成長好方式。由於實用自衛散手按級別分為不同色帶，及定期晉升考試制度，由白帶學起，可按學習進度考升級試一至十級，最終有機會升至黑帶。有了逐級晉升的目標，便會不斷自我挑戰，學習態度亦會更加專心，成功考取更高級別，更可提升成功感，滿足感及自信，從小培養不斷進步的學習態度。
      </p>
      <p>
        在科技發達的今天，學校和家庭給孩子的生活教育型態，物質重於精神，導致子們喪失了很多他們本身具有的功能──物質條件的富裕、生活規範的不夠嚴謹，導致孩子的柔弱和過於被動，抗壓能力普遍降低，這些都是父母應該關切的問題。我們是不是在忙於事業名利外，給自己和孩子的健康多做一點投資？
      </p>
      <strong>
        <p>本會為各大機構、團體、和個人度身訂做高水平及專業的訓練課程。</p>
        <p>
          歡迎幼稚園、中小學、專上院校、私人機構合辦長期或短期的實用散手自衛術訓練課程。
        </p>
      </strong>
      <div>
        <p>對 像：3 - 55歲，對武術散手自衛術有興趣的人士，均可參加。</p>
        <p>地 點：可在本會各區恆常團體武術訓練班上課班或私人教授均可。</p>
        <p>自組成班：自組五人即可在本港各區以團體班的形式開班。</p>
        <p>
          課程特點：可推薦學員報考國家認可自衞防身術段位證書，政府認可之散手自衛術章別計劃一至十級全港公開考核試，考取武術章別資格。
        </p>
        <p>教 練：本會由全職專業註册教練任教，全日任揀時段預约上課。</p>
      </div>
    </div>
    <h2>習武對孩子的好處</h2>
    <ol>
      <li>讓孩子更了解自己的身體和力量；調整良好儀態，調理強健體質。</li>
      <li>能讓孩子隨時具備了保護自己的觀念與能力，增加了自信和勇氣。</li>
      <li>能更輕鬆的去控制自己的外在肢體動作和內在情緒反應。</li>
      <li>學習實用散手自衛術增強保護自我的能力。</li>
    </ol>
    <professional-coach />
  </div>
</template>

<script>
import professionalCoach from "../../../components/others/professionalCoach.vue";

export default {
  components: { professionalCoach },
  name: "ChildrenWuShu",
};
</script>

<style lang="scss" scoped></style>
