<template>
  <div>
    <h1>泰拳课程</h1>
    <h2>減壓、瘦身、自衛防身</h2>
    <div>
      <p>
        本會屬於 香港泰拳理事會 核下屬會， 教授泰拳基本技巧包括步法， 拳招，
        肘招，
        腿招，膝招及散打自衛術技巧，這活動加強學員的防衛意識，透過擊靶訓練，培養反應及敏捷度。
      </p>
      <p>
        由經驗豐富的專業泰拳及散手教練的指導下，讓你真正認識泰拳運動的精神與打法，學習基本技巧，透過練習與訓練，可鍛練體能、增加肌肉，更可排汗塑身。享受運動的樂趣！
      </p>
      <p>教 練：本會由全職專業註册教練任教，全日任揀時段預约上課。</p>
    </div>
    <hr />
    <h2>歡迎私人授課，自組成班或包堂</h2>
    <div>
      <p>對 象：7歲或以上對泰拳有興趣人士</p>
      <p>地 點：香港、九龍、新界 私人會所/體育館或室外上課均可</p>
      <p>時 間：雙方協定，彈性上課時間及地點</p>
      <p>師 資：持有認可泰拳及Kick Boxing專業教練證書</p>
    </div>
    <hr />
    <h2>健體泰拳Boxing訓練班 恆常團體班現正招生</h2>

    <div>
      <p>開班目期：現正招生 10人成班</p>
      <p>對 象：12或以上對泰拳有興趣人士</p>
      <p>地 點：柴灣區上課（近地鐵站）</p>
      <p>時 間：逢星期二脕上8-10時</p>
      <p>師 資：持有認可泰拳及Kick Boxing專業教練證書</p>
      <p>備 註：每期五堂，須在二個月之内完成</p>
    </div>
    <hr />
    <p>
      教授内容：泰拳及拳擊基本動作姿勢，步法，發力，出拳，腿法，拳腿應用及閃避。拳、腳、肘、膝擊靶和對練等，—般體能訓練及散打自衛術技巧。
    </p>
  </div>
</template>

<script lang="ts">
import { defineComponent } from "vue";

export default defineComponent({
  name: "MuayThai",
});
</script>

<style lang="scss" scoped></style>
