<template>
  <div>
    <h1>女子自衛術課程</h1>
    <p>
      女子自衛術是一項專為女子而設的訓練課程，課程內容會以女子防衛術作主要的訓練，這是一項運用踢、打、摔、拿等武術技擊的方法，如當面臨受制於歹徒時，並具備簡單、實用、易記、易學的特點。它是一種以制服對方、保護自己為目的的專門技術。此課程將會由淺入深地介紹自衛術的基本概念及原理，適合現代女性的自我防衛技術。
    </p>
    <p>
      此課程為個人/小組的訓練課程，並由持有專業資格教練親自指導，教練與學員課程前的訪談和進行瞭解，而設計一份訓練訓劃，為不同程度的學員度身訂做一套教學模式，確保每位學員在每次訓練中都能吸收其訓練效果。
    </p>
    <p>
      在專業導師的指導下，確保您在安全情況下盡情鬆弛減壓及體驗女子自衛術的真正樂趣，在短期內有效改善自衛搏擊技巧。增強心肺功能、有效燃燒體脂肪、加強身體協調性、反應力、敏銳度與速度。為了配合您繁忙的生活節奏，我們每星期七天均可以提供全日不同時段課堂，讓您選擇最合適方便的上課地點及時間。
    </p>
    <strong>
      <p>
        歡迎幼稚園、中小學、專上院校、私人機構合辦長期或短期的防身自衛術訓練課程。
      </p>
      <p>歡迎私人授課，自組成班或包堂（時間及地點雙方協定）</p>
    </strong>
    <p>課程師資：由香港認可註册武術教練及持有防身自衛術三段證書的專業資格。</p>
    <p>教 練：本會由全職專業註册教練任教，全日任揀時段預约上課。</p>
    <hr />
    <h2>歡迎私人授課，自組成班或包堂</h2>
    <p>課 程：女子防身自衛術</p>
    <p>對 象：7歲或以上對防身自衛術有興趣人士</p>
    <p>地點：香港、九龍、新界 私人會所/體育館或室外上課均可</p>
    <p>時間：雙方協定，彈性上課時間及地點</p>
    <hr />
    <p>
      女子自衛術課程特點：
      女子自衛術技術特點、使用原則、制敵部位、基本功法、技術動作、招法訓練、針對不同侵害方式的自衛招法、
      特殊情況下的自衛招法的運用。
    </p>
    <p>
      防身四大觀念： １、隨時注意安全 ２、迴避危險情境 ３、迅速逃離危機
      ４、冷靜面對歹徒
    </p>
    <p>
      自衛術制敵的有效部位 ( 1 ) 眼睛 ( 2 ) 咽喉 ( 3 ) 頸側 ( 4 ) 腋下 ( 5 )
      襠部
    </p>
    <p>
      自衛術基本訓練內容 ( 1 ) 拳法 ( 2 ) 掌法 ( 3 ) 肘法 ( 4 ) 腿法 ( 5 ) 膝法
      ( 6 ) 擒拿 ( 7 ) 摔法 ( 8 ) 基本護身倒法
      同時配以不同程度的手把、腳靶，配合拳、腿、肘、膝擊靶等訓練。
    </p>
    <p>
      自衛術基本課程 (1) 人體薄弱要害部位 (2) 自衛術基本技術 (3) 實用攻擊技術
      (4) 自衛實戰功夫應用 (5) 安全防范常識
    </p>
    <p>
      化解摟抱技巧之練習及運用 (1) 腕部被抓解脫技術 (2) 前後抱腰解脫技術 (3)
      前後鎖喉解脫技術 (4) 雙手被抓解脫技術 (5) 胸襟被抓解脫技術 (6)
      前後抓肩解脫技術 (7) 前後抓頭解脫技術 (8) 抓腕解脫反擒法 (9)
      抓胸解脫反擒法 (10) 前勒解脫反擒法 (11) 前抓解脫反擒法
    </p>

    <p>
      男女老少皆宜學習
      自衛術的優點是不論3歲到55歲，從兒童到年長者，不管男女老少，只要身體硬朗都適合學習。可另學員增強身體協調及機能，改善學員身體質素及靈敏度，達到宣洩情緒、舒解壓力及纖體功效。
    </p>
    <p>
      備註: (1) 可選擇私人一對一、親子班或小組形式上課，可於 (戶外或上門教授) 或
      (學員提供場地) 授課。 (2) 十三歲或以上成人，每堂1.5小時計算，
      十二歲或以下兒童，每堂1小時，四堂為一期 。 (3)
      每期課程逾期四十日後將當放棄上堂論，所有課程將會被取消。 (4)
      為了配合繁忙的生活節奏，我們每天全日均可提供不同時段上課，讓您選擇最合適方便的地點及時段上課。
      (5)
      本會可推薦報考國家認可自衛防身術證書，政府認可之散手章別計劃全港考核試及各專業證書課程。
      (6)
      私教學員每月可不限次數、時段及地點上課。目的是希望新學員有更多的時間和機會練習。
      (7) 各私教學員經考核合格，可申請認可實用自衛散手級位或段位証書。
    </p>
  </div>
</template>

<script>
export default {
  name: "NvZiZiWeiShu",
};
</script>

<style lang="scss" scoped></style>
