<template>
  <Markdown :source="source" />
</template>

<script>
import Markdown from "@/components/others/Markdown.vue";
export default {
  name: "NvZiZiWeiShu",
  components: {
    Markdown,
  },
  data() {
    return {
      source: `# 女子自卫术

引言

女子自衛術是一項專為女子而設的訓練課程，課程內容會以女子防衛術作主要的訓練，這是一項運用踢、打、摔、拿等武術技擊的方法，如當面臨受制於歹徒時，並具備簡單、實用、易記、易學的特點。它是一種以制服對方、保護自己為目的的專門技術。此課程將會由淺入深地介紹自衛術的基本概念及原理，適合現代女性的自我防衛技術。

此課程為個人/小組的訓練課程，並由持有專業資格教練親自指導，教練與學員課程前的訪談和進行瞭解，而設計一份訓練訓劃，為不同程度的學員度身訂做一套教學模式，確保每位學員在每次訓練中都能吸收其訓練效果。

在專業導師的指導下，確保您在安全情況下盡情鬆弛減壓及體驗女子自衛術的真正樂趣，在短期內有效改善自衛搏擊技巧。增強心肺功能、有效燃燒體脂肪、加強身體協調性、反應力、敏銳度與速度。為了配合您繁忙的生活節奏，我們每星期七天均可以提供全日不同時段課堂，讓您選擇最合適方便的上課地點及時間。

内容简介（以下列表统一格式）

女子自衛術課程特點： 女子自衛術技術特點、使用原則、制敵部位、基本功法、技術動作、招法訓練、針對不同侵害方式									 的自衛招法、 特殊情況下的自衛招法的運用。

防身四大觀念： １、隨時注意安全 ２、迴避危險情境 ３、迅速逃離危機 ４、冷靜面對歹徒

自衛術制敵的有效部位 ( 1 ) 眼睛 ( 2 ) 咽喉 ( 3 ) 頸側 ( 4 ) 腋下 ( 5 ) 襠部

自衛術基本訓練內容 ( 1 ) 拳法 ( 2 ) 掌法 ( 3 ) 肘法 ( 4 ) 腿法 ( 5 ) 膝法 ( 6 ) 擒拿 ( 7 ) 摔法 ( 8 ) 基本護身倒法 同時配以不同程度的手把、腳靶，配合拳、腿、肘、膝擊靶等訓練。

自衛術基本課程 (1) 人體薄弱要害部位 (2) 自衛術基本技術 (3) 實用攻擊技術 (4) 自衛實戰功夫應用 (5) 安全防范常識

化解摟抱技巧之練習及運用 (1) 腕部被抓解脫技術 (2) 前後抱腰解脫技術 (3) 前後鎖喉解脫技術 (4) 雙手被抓解脫技術 (5) 胸襟被抓解脫技術 (6) 前後抓肩解脫技術 (7) 前後抓頭解脫技術 (8) 抓腕解脫反擒法 (9) 抓胸解脫反擒法 (10) 前勒解脫反擒法 (11) 前抓解脫反擒法

## 详情

教学形式：上门教授、私人、小组教学

教练：本会由全职专业注册教练任教（持有香港认可注册武术教练及防身自卫术三段證書专业资格）

对象：**7**歲或以上對防身自衛術有興趣人士

时段：私人组班时间为双方协定，可灵活安排合适时段

地点：双方协定，可于室外、各區體育館、私人会所或學員提供室內場地練習

常规班

**灣仔 港灣道體育館**  星期三  5:00 - 6:30 pm

如希望自行组班或报名私人班，欢迎浏览*私人及组班课程*

如有任何疑问，欢迎*联络我们进行咨询`,
    };
  },
};
</script>

<style lang="scss" scoped></style>
