<template>
  <div>
    <h1>私人武術課程</h1>
    <div>
      <p>
        可親子班、一對一、多人或小組形式上課，可選擇戶外、上門教授或由學員提供場地授課，彈性上課時間及地點。
      </p>
      <p>
        歡迎私人、小組、公司、學校、團體機構合辦各項長期或短期武術訓練課程。
      </p>
      <p>4-12歲（每堂1小時） 13歲或以上（每堂1.5 - 2小時）</p>
      <p>教 練：本會由全職專業註册教練任教，全日任揀時段預约上課。</p>
    </div>
    <h2>歡迎私人授課，自組成班或包堂</h2>
    <div>
      <p>課 程：散手自衛術訓練課程</p>
      <p>對 象：5歲或以上對中國武術有興趣人士</p>
      <p>地 點：香港、九龍、新界 私人會所/體育館或室外上課均可</p>
      <p>時 間：雙方協定，彈性上課時間及地點</p>
      <p>師 資：持有香港認可武術散手及裁判專業資格教練</p>
    </div>
    <hr />
    <div>
      <p>課 程：女子防身自衛術課程</p>
      <p>對 象：7歲或以上對防身自衛術有興趣人士</p>
      <p>地 點：香港、九龍、新界 私人會所/體育館或室外上課均可</p>
      <p>時 間：雙方協定，彈性上課時間及地點</p>
      <p>師 資：持有國家認可防身自衛術三段專業資格證晝</p>
    </div>
    <hr />
    <div>
      <p>課 程：健體泰拳Kick Boxing</p>
      <p>對 象：7歲或以上對泰拳有興趣人士</p>
      <p>地 點：香港、九龍、新界 私人會所/體育館或室外上課均可</p>
      <p>時 間：雙方協定，彈性上課時間及地點</p>
      <p>師 資：持有認可泰拳及Kick Boxing專業教練證晝</p>
    </div>
    <hr />
    <div>
      <p>課 程：吳家鄭式大極拳</p>
      <p>對 象：10歲或以上對太極拳有興趣人士</p>
      <p>地 點：香港、九龍、新界 私人會所/體育館或室外上課均可</p>
      <p>時 間：雙方協定，彈性上課時間及地點</p>
      <p>師 資：持有香港合資格太極拳教練證晝</p>
      <p>
        基礎班之新學員，每個月可不限次數、時段及地點上課。目的是希望新學員有更多的時間和機會練習，將基礎打好，增强體能和自信，並對運動之理論有更多的認識。
      </p>
    </div>
    <hr />
    <h2>課程特點：</h2>
    <p>
      私人課程為個人或小組密集式訓練，並由專業教練親自指導，教練與學員課程前的訪談和進行瞭解，而設計一份訓練計劃，為不同程度的學員度身訂做一套教學內容，每位學員上課內容可能會略有不同，以確保每位學員在每次訓練中都能達至明顯的訓練效果。學員藉由不同的教學方式。
    </p>
    <p>
      武術屬於全身帶氧運動，是一種能夠防身自衛、瘦身健美、增加自信的體育運動，因此現已成為一種都市非常流行的運動，私人課程教練具備各項教練及裁判證書的專業資格，能為學員提供度身訂造合適的訓練計劃。專業教練以化繁為簡，通過武術特有的動作，循序漸進地增加運動量以達至強身健體及修身減脂的功能，而學員們更可自行組班作定時定點的訓練，使課堂更有彈性。
    </p>
    <professional-coach />
    <class-info-notes />
  </div>
</template>

<script>
import professionalCoach from "../../../components/others/professionalCoach.vue";
import ClassInfoNotes from "../../../components/others/ClassInfoNotes.vue";
export default {
  components: { professionalCoach, ClassInfoNotes },
  name: "PrivateWuShu",
};
</script>

<style lang="scss" scoped></style>
