<template>
  <h1>太極班課程</h1>
  <markdown :source="source" />
</template>

<script>
import Markdown from "@/components/others/Markdown.vue";
export default {
  components: { Markdown },
  name: "TaiChi",
  data() {
    return {
      source:
        "## 引言\n香港人做事争分夺秒，工作压力大，运动量少，以致经常出现精神紧张、肌肉紧绷、关节劳损等都市病。因此，运动对于任何人都可谓不可而缺少。那如何才能选择适合自己的运动呢？气势任何运动对健康都有益处，不过想要性运动中改善自己的健康的话，便需要持之以恒。然而有些运动，比如跑步、球类、技击等，长时间的练习可能领你的肌肉劳损，关节受伤，而且年紀越大便越會覺得體能上難以應付。\n而太極拳與一般運動不同，它不受年齡大小、體能強弱的影響。因為太極拳以柔為主，以緩慢如流水般的動作、绵长的呼吸，意識的專注配合，持之以恒地練習，定能改善血液循環，促進新陳代謝，增強心肺功能、强化肌肉、关节和骨质、清除壓力，使身體各部份得以放鬆，達至身心內外平衡，增強抵抗力，身體自然得到健康。\n## 详情\n教学形式：上门教授、私人、小组教学\n教练：本会由全职专业注册教练任教（香港太極總會持牌太極導師\n对象：凡對太極拳有興趣者，均可參加\n时段：私人组班时间为双方协定，可灵活安排合适时段\n地点：双方协定，可于室外、各區體育館或學員提供室內場地練習\n## 常规班\n**紅磡 香港體育館側 4:00－5:30pm**\n**坑口文曲皇公園 4:00－5:30pm**\n**灣仔 港灣道公園 4:00－5:30pm**\n**沙田 公園 4:00－5:30pm**",
    };
  },
};
</script>
