<template>
  <h1>太極班課程</h1>
  <section-blocks :sections="sections" />
</template>

<script lang="ts">
import SectionBlocks from "@/components/others/SectionBlocks.vue";
import { defineComponent, ref } from "vue";

export default defineComponent({
  name: "TaiChi",
  components: { SectionBlocks },
  setup() {
    const sections = ref([
      {
        h2: "引言",
        paragraphs: [
          "香港人做事争分夺秒，工作压力大，运动量少，以致经常出现精神紧张、肌肉紧绷、关节劳损等都市病。因此，运动对于任何人都可谓不可而缺少。那如何才能选择适合自己的运动呢？气势任何运动对健康都有益处，不过想要性运动中改善自己的健康的话，便需要持之以恒。然而有些运动，比如跑步、球类、技击等，长时间的练习可能领你的肌肉劳损，关节受伤，而且年紀越大便越會覺得體能上難以應付。",
          "而太極拳與一般運動不同，它不受年齡大小、體能強弱的影響。因為太極拳以柔為主，以緩慢如流水般的動作、绵长的呼吸，意識的專注配合，持之以恒地練習，定能改善血液循環，促進新陳代謝，增強心肺功能、强化肌肉、关节和骨质、清除壓力，使身體各部份得以放鬆，達至身心內外平衡，增強抵抗力，身體自然得到健康。",
        ],
      },
      {
        h2: "详情",
        paragraphs: [
          "教学形式：上门教授、私人、小组教学",
          "教练：本会由全职专业注册教练任教（香港太極總會持牌太極導師/師資訓練班畢業證書）",
          "对象：凡對太極拳有興趣者，均可參加",
          "时段：私人组班时间为双方协定，可灵活安排合适时段",
          "地点：双方协定，可于室外、各區體育館或學員提供室內場地練習",
        ],
      },
      {
        h2: "常规班",
        paragraphs: [
          "**紅磡 香港體育館側 4:00－5:30pm**",
          "**坑口文曲皇公園 4:00－5:30pm**",
          "**灣仔 港灣道公園 4:00－5:30pm**",
          "**沙田 公園 4:00－5:30pm**",
        ],
      },
      {
        startLine: true,
        paragraphs: [
          "如希望自行组班或报名私人班，欢迎浏览*私人及组班课程*",
          "如有任何疑问，欢迎进行咨询",
        ],
      },
    ]);

    return { sections };
  },
});
</script>
