<template>
  <div>
    <h1>太極班課程</h1>
    <h2>引言</h2>
    <div>
      <p>
        香港人做事爭分奪秒，工作壓力大，運動量少，以致經常出現精神緊張，肌肉崩緊，關節勞損等都市病。因此，運動對於任何人都可謂不可缺少。但如何選擇適合自己的運動呢？其實任何運動對健康都有益處，不過要從運動中增進健康是需要持之以恒的。然而有些運動如跑步，球類、或技擊等，長年練習可能會令你的肌肉勞損、關節受傷，而且年紀越大便越會覺得體能上難以應付。
      </p>
      <p>
        太極拳與一般運動不同，它不受年齡大小、體能強弱的影響。因為太極拳以柔為主，以緩慢如流水般的動作、深長的呼吸，意識的專注配合，持之以恒地練習，定能改善血液循環，促進新陳代謝，增強心肺功能、肌肉、關節和骨質的強化，清除壓力，使身體各部份得以放鬆，達至身心內外平衡，增強抵抗力，身體自然得到健康。
      </p>
      <p>本會為各大機構、個人和團體度身訂做高質素的各項武術訓練班。</p>
    </div>
    <h2>為不同年齡的人士提供</h2>
    <div>
      <ol>
        <li>吳家鄭式（方拳、圓拳）太極拳健體訓練課程。</li>
        <li>長者養生太極健生操訓練班。</li>
        <li>長者健體椅上操/伸展熱身及带氣運動課程。</li>
      </ol>
      <p>歡迎私人、小組、公司、學校、團體機構合辦太極拳健身課程。</p>
    </div>
    <p>教 練：本會由全職專業註册教練任教，全日任揀時段預约上課。</p>
    <p>
      課程導師：香港太極總會持牌太極導師/師資訓練班畢業證書（具備十多豐富私人及小组班教授經驗）
    </p>
    <div>
      <p>
        教學形式：上門教授、私人、小組教學。（自組六人即可在各區以團體的形式開班）
      </p>
      <p>對 像：凡對太極拳有興趣者，均可參加。</p>
      <p>上課時間：時間雙方協議，靈活安排適合自己的時段。</p>
      <p>地 點：地點雙方協定，可室外、各區體育館或學員提供室內場地練習。</p>
    </div>
    <div>
      基礎班之新學員，每個月可不限次數、時段及地點上課。目的是希望新學員有更多的時間和機會練習，將基礎打好，增强體能和自信，並對太極拳之理論有更多的認識。
    </div>
    <h2>團體恆常班 上課地點/時間 （歡迎自行組班）</h2>
    <ol>
      <p>紅磡 香港體育館側 4:00－5:30pm</p>
      <p>坑口文曲皇公園 4:00－5:30pm</p>
      <p>灣仔 港灣道公園 4:00－5:30pm</p>
      <p>沙田 公園 4:00－5:30pm</p>
    </ol>
    <!-- TODO: 活动照片 -->
  </div>
</template>

<script>
export default {
  name: "TaiChi",
};
</script>
