<template>
    <render-view :route="'/about/bylaws'" />
</template>


<script setup>
import { RenderView } from "#components"

useSeoMeta({
    title: '本會章程',
    description: '家長及會員必須仔細閱讀以下守則 1.會員必須以禮待人，尊師重道；無論進出道場、上課下課，必須向教練行禮。2. 學員必須穿著本會認可制服及必須把鞋脫掉，否則教練有權拒絕其進入道場練習。3. 本會有權在道場拍攝及錄影學員練習情況，以作課程練習記錄及日後本會網站宣傳之用。4. 會員有責任在上課時配戴本會指定合適護具，以保障在對練時自身及他人的安全 。5.本會以每年平均四十八節課堂為計算單位，平均每月四節課，每節一小時。6. 會員須準時出席課堂，如上課當日被列為法定公眾假期，是日之課堂將會取消(以囗頭通知或通告為準)。7.如學員缺席當日課程，可自行選日子到其它道場進行補課。8. 如因私人理由而缺席課堂，必須最遲在上課前二小時以短訊或電話形式通知有關道場教練。9. 為方便本會調動教練及編排教學課程，學員如須請假，必須致電或以短訊形式知會道場教練。10. 如學員無故缺席兩堂或以而未有請假者，本會將即時取消其會員資格及消毀其全部個人資料而不作另行通知。11. 遇惡劣天氣，天文台於上課時間兩小時前已除下黑色暴雨警告訊號或除下八號或以上之颱風訊號，所有課堂將會如常舉行。12. 為保障個人私隱，會員之個人資料將於退會後一個星期內銷毀。13. 本會保留更改章則及本會網頁所有內容之權利而不作另行通知。14. 各會員必須遵守以上章則及謹記本會宗旨',
    // reactive example
    // ogImage: () => someData.value?.image
})
</script>
